[
{"writers": ["Ahmet Aksoy"], "publisher": "ABAKÜS KİTAP", "num_reviews": 0, "stars": 0, "price": 133.2, "url": "https://www.kitapyurdu.com/kitap/yeni-baslayanlar-icin-python/395800.html&filter_name=python", "title": "Yeni Başlayanlar İçin Python", "category": "Bilgisayar", "page": 424, "bought": 919, "description": "Python programlama dili, dünya çapında giderek artan bir hızla yaygınlaşmakta, özellikle herhangi bir programlama geçmişi olmayan kullanıcıların ilgisini çekmektedir. 2015 sonu itibariyle dünyada en popüler diller arasında sekizinci sıradan dördüncülüğe yükselmiştir. Ayrıca Python, Fransa ve Amerika gibi ülkelerde seçmeli programlama dili olarak lise ve üniversitelerde birinci sıraya yükselmiş durumdadır. Bunun sebebi, Python’un kullanıcı dostu bir dil olması ve yorumlayıcı bir dil olarak çok kuvvetli bir altyapıya sahip olmasıdır. "},
{"writers": ["Ahmet Aksoy"], "publisher": "Abaküs Kitap", "price": 123.95, "url": "https://www.kitapsepeti.com/python-267586", "title": "Python", "category": " Bilgisayar", "page": 424, "description": "Python programlama dili, dünya çapında giderek artan bir hızla yaygınlaşmakta, özellikle herhangi bir programlama geçmişi olmayan kullanıcıların ilgisini çekmektedir. 2015 sonu itibariyle dünyada en popüler diller arasında sekizinci sıradan dördüncülüğe yükselmiştir. Ayrıca Python, Fransa ve Amerika gibi ülkelerde seçmeli programlama dili olarak lise ve üniversitelerde birinci sıraya yükselmiş durumdadır. Bunun sebebi, Python’un kullanıcı dostu bir dil olması ve yorumlayıcı bir dil olarak çok kuvvetli bir altyapıya sahip olmasıdır. Python kodları genellikle Java‘dan 3 ila 5 kez, C++’dan 5 ila 10 kez daha kısadır.", "num_reviews": 0},
{"writers": ["Süleyman Gökhan Günay"], "publisher": "Paradigma Akademi Yayınları", "price": 84.7, "url": "https://www.kitapsepeti.com/python-ile-finansa-giris", "title": "Python İle Finansa Giriş", "category": " Ekonomi", "page": 139, "description": "Python ile Finansa Giriş isimli kitapta son yıllarda finans dünyasında çok kullanılan Python programlama dilini kullanarak basit finans problemleri çözülmektedir. Bu kitapta amaç kullanıcıya Python yazılım dilinin finans problemlerinin içinde nasıl kullanıldığını göstermek olduğu için burada yer alan bilgiler giriş seviyesindedir. Bu kitapta reel faiz oranı, basit faiz oranı, gelecek değer, bugünkü değer ve anüiteler şeklinde finans alanında paranın zaman değeri içinde yer alan finansal problemler çözülmüştür. Dünyada en çok kullanılan yapay zekâ dili olan Python yazılımı finans alanındaki problemleri çok hızlı ve etkin bir şekilde çözebilmektedir. Python ile Finansa Giriş isimli kitap serinin ilk kitabı olup daha sonra yayınlanması planlanan kitaplarda daha ileri seviyede finans problemleri çözülecektir. Kitapta verilen kodlar Visual Studio Code veya PyCharm veya Spyder gibi editörlerde çalıştırılabilir. Bu kitap hem öğrencilerin hem de yöneticilerin finans problemlerini çözmek konusunda kullanabilecekleri başlangıç seviyesinde yardımcı bir eserdir.", "num_reviews": 0},
{"writers": ["Volkan Taşçı"], "publisher": "Dikeyeksen Yayın Dağıtım", "price": 216.0, "url": "https://www.kitapsepeti.com/python-egitim-kitabi", "title": "Python Eğitim Kitabı", "category": " Bilgisayar", "page": 560, "description": "Python öğrenmek için ihtiyacınız olan tek kitap! Python Eğitim Kitabı, öğrenciler, mühendisler, çalışanlar ve Python öğrenmek isteyenler düşünülerek herkese hitap edecek şekilde görsellerle zenginleştirilmiş, bolca kod örnekleri ve projelerle okura pratiklik kazandırılması amaçlanarak kaleme alınmıştır. Projeler özellikle okurun düşünme refleksine yön vermek için bazen zorlu yollarla tasarlanmış bazen de pratiklik kazandırması amacıyla kolay yollar tercih edilmiştir. Yalnızca Python değil diğer tüm programlama dilleri için geçerli olan verilerin saklanması konusu birden çok metot ile gösterilmiş, farklı dosya formatları ile çalışması anlatılmıştır. Belki de en önemli konu olan Nesne Tabanlı Programlama derinlemesine işlenmiş örneklerle pekiştirilmiştir.", "num_reviews": 0},
{"writers": ["François Chollet"], "publisher": "Buzdağı Yayınevi", "price": 430.65, "url": "https://www.kitapsepeti.com/python-ile-derin-ogrenme", "title": "Python ile Derin Öğrenme", "category": " Bilim - Mühendislik", "page": 400, "description": "Makine öğrenmesi son yıllarda oldukça çarpıcı bir ilerleme sağladı: Konuşma ve görüntü tanımada çok kötüydük fakat insana yakın doğruluğa geçtik, ortalama bir Go oyuncusunu yenemeyen uygulamalardan dünya şampiyonlarını yenen uygulamalar geliştirme noktasına geldik. Bu ilerlemenin arkasında derin öğrenme var.", "num_reviews": 0},
{"writers": ["Yılmaz Alaca"], "publisher": "DİKEYEKSEN YAYINCILIK", "num_reviews": 0, "stars": 0, "price": 171.88, "url": "https://www.kitapyurdu.com/kitap/python-ile-gomulu-sistemlerde-arduino-icin-arayuz-gelistirme/653488.html&filter_name=python", "title": "Python ile Gömülü Sistemlerde Arduino için Arayüz Geliştirme", "category": "Bilgisayar", "page": 148, "bought": 5, "description": "Python yazılım dilini kullanarak hem arayüz kodlamayı hem de seri port kontrolünü bir arada öğreneceğiniz bu kitapla birlikte; Arduino dahil tüm gömülü sistem kartlarını, oluşturduğunuz arayüzlerle kontrol edebileceksiniz. Ayrıca, kitap içerisinde çeşitli modüllerin kullanımı (röle, DHT-11, Yağmur Sensörü, LCD ekran vb.), 15’ten fazla örnek ve 3 farklı kapsamlı proje mevcut. Sizler de Python ve Arduino’nun Haberleşmesinden, LCD ekran kontrol arayüzünün geliştirilmesine, arayüz kodlanmasından sensör bilgi arayüzünün oluşturulmasına kadar detaylı bilgi sahibi olacaksınız."},
{"writers": ["Erdal Delebe", "Serhat Kağan Şahin"], "publisher": "UNIKOD", "num_reviews": 5, "stars": 5, "price": 112.0, "url": "https://www.kitapyurdu.com/kitap/python-micro-programlama-temelleri/536476.html&filter_name=python", "title": "Python Micro Programlama Temelleri", "category": "Bilgisayar", "page": 408, "bought": 161, "description": "Uzun cümlelere hiç gerek yok. Bilişim Teknolojileri Eğitimcileri Derneği serisinin 3. kitabı olan “Python ve microPYTHON Programlama”, bilişim teknolojileri eğitiminin kaynak ihtiyacını karşılamak için alanın iki önemli ismi tarafından hazırlandı. Kitap, engin alan bilgisinin ötesinde, içerik sunumu, örneklerin seçimi, bölümlerin yapılandırması gibi her sayfasında fark edeceğiniz öğretmenlik deneyimi ile kazanılmış bir uzmanlığın ürünüdür. Öğrenciler, öğretmenler, programlamaya ilgi duyanlar ve çağın diline hakim olmak isteyenler için faydalı olması dilekleriyle…"},
{"writers": ["Engin Sorhun"], "publisher": "Abaküs Kitap", "price": 123.95, "url": "https://www.kitapsepeti.com/python-ile-makine-ogrenmesi", "title": "Python ile Makine Öğrenmesi", "category": " Bilgisayar", "page": 464, "description": "Bu Çalışmada 31 Makine Öğrenmesi Algoritması, 22 Makine Öğrenmesi Metodu, 33 Python Kütüphanesi, 14 Özgün Veri Seti İle Sosyal Bilimlerin Özellikle Ekonomi, Finans, İşletme Alanlarına Dair Örnek Uygulamalar Yer Almaktadır. ", "num_reviews": 0},
{"writers": ["Engin Sorhun"], "publisher": "Abaküs Kitap", "price": 100.5, "url": "https://www.kitapsepeti.com/python-ile-ekonometri", "title": "Python ile Ekonometri", "category": " Eğitim", "page": 352, "description": "İstatistik ve ekonometri paket programları için her sene neden milyonlarca dolar ödüyoruz? Üniversitelerimiz, özel ve kamu sektörü kuruluşları, araştırma merkezleri, bilim insanları, öğrenciler… Şimdi dünyanın açık kaynaklı (ücretsiz) araçlara yelken açtığı bir zamanda bir avuç şirkete yaptığımız bunca ödeme ne kadar gerekli?", "num_reviews": 0},
{"writers": ["Gökhan Su"], "publisher": "Kodlab Yayın Dağıtım", "price": 76.23, "url": "https://www.kitapsepeti.com/python-ogreniyorum", "title": "Python Öğreniyorum", "category": " Bilgisayar", "page": 204, "description": "Bu kitapta, son zamanların en sevilen ve kullanışlı dillerinden biri olan Python 3, yenilikleri ile birlikte anlatılmıştır. Arayüz ve interaktif kabuk ile başlanıp, kullanılabilecek pek çok komut detaylıca ve örneklere dayandırılarak anlatılmıştır. Birbirinden öğretici, keyifli uygulama ve oyunlar ile programlama dünyasına zevkli bir giriş hedeflenmiştir. Ayrıca her bölümde", "num_reviews": 0},
{"writers": ["Burak Yıldız"], "publisher": "Kodlab Yayın Dağıtım", "price": 192.5, "url": "https://www.kitapsepeti.com/python-projeler-ve-populer-kutuphaneler", "title": "Python Projeler ve Popüler Kütüphaneler", "category": " Bilgisayar", "page": 704, "description": "Günümüzde Google, Instagram, Yahoo, Nasa gibi kuruluşlar tarafından tercih edilen ve gittikçe popüler olan Python programlama dili pek çok alanda kullanılmaktadır. Basit yapısı ve büyük yetenekleri sayesinde programlamaya yeni başlayan kişiler için öğrenilmesi kolay bir dildir. Sürekli güncellenen yapısı ve aktif geliştirici topluluğu sayesinde artık Python programlama dili ile yapacaklarınız sadece hayallerinizle sınırlı!", "num_reviews": 0},
{"writers": ["Caner Erden"], "publisher": "Kodlab Yayın Dağıtım", "price": 103.95, "url": "https://www.kitapsepeti.com/python-ile-veri-madenciligi", "title": "Python İle Veri Madenciliği", "category": " Bilgisayar", "page": 312, "description": "Bu kitapta Python programlama dili ile veri madenciliği uygulamaları gösterilmiştir. Python programlama dili son zamanlarda en fazla kullanılan dil olma özelliğine sahip. Özellikle Yapay Zekâ uygulamalarında Python programlama diline olan rağbet artmaktadır. Bu kitapta Python programlama diline hızlı bir giriş için de bir bölüm bulunmaktadır. Bu anlamda bu bölüm, programlama tecrübesi olmayan okuyucular için de bir rehber olarak görülebilir.", "num_reviews": 0},
{"writers": ["Engin Bozaba"], "publisher": "DİKEYEKSEN YAYINCILIK", "num_reviews": 0, "stars": 0, "price": 137.5, "url": "https://www.kitapyurdu.com/kitap/python-ile-uctan-uca-veri-bilimi/622921.html&filter_name=python", "title": "Python ile Uçtan Uca Veri Bilimi", "category": "Bilgisayar", "page": 280, "bought": 45, "description": "Bu kitap ile Python programlama bilginizi kullanarak Veri Bilimi dünyasına ilk adımınızı atacaksınız. Kitapla birlikte başlangıç seviyesinden basamak basamak çıkarak uçtan uca bir veri bilimi proje geliştirebileceksiniz. Ve aynı zamanda bu yolda kullanacağımız araçları, kütüphaneleri ve yöntemleri beraber deneyimleyeceğiz. Ama bu kitap sadece sizin için bir başlangıçtır. Çünkü asıl kazanımlarınızı kitap sonrası kendi başınıza veya ekibinizle geliştirdiğiniz projelerde elde edeceksiniz."},
{"writers": ["Olcay Taner Yıldız"], "publisher": "Seçkin Yayıncılık", "price": 91.35, "url": "https://www.kitapsepeti.com/python-ile-programlamaya-giris", "title": "Python ile Programlamaya Giriş", "category": " Akademik", "page": 200, "description": "Kitap, mühendislere programlamaya giriş dersi için kaynak kitap olarak tasarlanmıştır. Programlamaya giriş dersi, Mühendislik eğitimi veren birçok üniversitede standart birinci sınıf dersi olarak okutulmaktadır.", "num_reviews": 0},
{"writers": ["Algın Okursoy"], "publisher": "Gazi Kitabevi", "price": 43.46, "url": "https://www.kitapsepeti.com/cok-kriterli-karar-verme-python-programlama-dili-ile-uygulama", "title": "Çok Kriterli Karar Verme: Python Programlama Dili ile Uygulama", "category": " Akademik", "page": 95, "description": "Birinci Bölüm: Karar Verme", "num_reviews": 0},
{"writers": ["Gokhan Bakal"], "publisher": "Nobel Akademik Yayıncılık", "price": 53.9, "url": "https://www.kitapsepeti.com/text-mining-applications-using-real-world-data-in-python", "title": "Text Mining Applications Using Real - World Data in Python", "category": " Bilgisayar", "page": 124, "description": "Over the last two decades, the amount of existing data sources in the world have dramatically increased due largely to digitalization. In parallel, data analysis has become a crucial topic for researchers in many areas. One of the essential perspectives in data analysis is text mining. In various forms, textual data is the most generated data element compared to multimedia data. Since the available data sizes are exponentially increasing, we need intelligent computational methodologies to handle massive datasets. Data mining approaches, specifically text mining techniques, come into prominence. The application of both text mining and machine learning techniques together on data analysis provides decent solutions. For that purpose, this book is prepared with four major chapters discussing various aspects of data analysis with text mining methods, such as clustering, classification, sentiment analysis, and prediction tasks implemented in the Python programming language.", "num_reviews": 0},
{"writers": ["Ali Çetinkaya"], "publisher": "İstanbul Gelişim Üniversitesi Yayınları", "price": 242.55, "url": "https://www.kitapsepeti.com/bulanik-mantik-ve-python-uygulamalari", "title": "Bulanık Mantık ve Python Uygulamaları", "category": " Akademik", "page": 144, "description": "Gelişen ve değişen teknoloji ile cihazların kontrolü üzerindeki ihtiyaç günden güne artmaktadır. Mevcut sistemlerin kontrolünde, yazılım dilleri üzerinde geliştirilen algoritmaların önemi büyüktür. Bulanık mantık (BM) sistemlerin kontrolü hayatımızın ayrılmaz bir parçası haline gelmiştir. Bulanık mantık hakkında yabancı dillerde çok sayıda çalışma mevcuttur. Bunlar arge araştırmaları, kitaplar, ders notları, makaleler ve bildiri çalışmalarıdır. Bu yayınlar arasında günümüz programlama dillerinden olan Python programlama dili ile hazırlanmış kapsamlı bir Türkçe Bulanık mantık kaynağı yer almamaktadır. Bu kitap Python programlama dili üzerinde geliştirilmiş bulanık mantık çalışmaları konusunda Türkçe literatüre katkı sağlayacaktır. ", "num_reviews": 0},
{"writers": ["Gizem Kodak"], "publisher": "Nobel Bilimsel Eserler", "price": 65.45, "url": "https://www.kitapsepeti.com/denizcilik-perspektifinden-python-program-dilinin-temelleri", "title": "Denizcilik Perspektifinden Python Program Dilinin Temelleri", "category": " Sosyoloji", "page": 126, "description": "Günümüzde, gemilerin AIS (Otomatik Tanımlama Sistemi) ile donatılması, denizcilik disiplini içerisinde birçok bilimsel alana büyük veri ile çalışma imkânı sunmaktadır. Özellikle yüksek çözünürlüklü sonuçlar veren model çalışmalarında veri analizi için kullanışlı program dillerine olan ihtiyaç her geçen gün artmaktadır. Gemilerin AIS sinyalleri üzerinden anlık olarak izlenmesiyle oluşan büyük veri, çevresel boyutta gemi emisyon hesaplamaları ve hava kalitesi modellerinden seyir boyutunda risk analizi ve kaza modellemesine kadar geniş bir yelpazede çalışma fırsatı sağlamaktadır. Python program dili bu veriyi işleme konusunda kritik bir araçtır. Python kullanımı için temel bilgileri içeren bu çalışmada Python operatörleri, Python`da kullanılan veri tipi/yapıları incelenmiş, gömülü fonksiyonlar ve yaygın olarak kullanılan pratik metotlar örneklerle açıklanmıştır. İç içe veriler, koşullu ifadeler ve döngü kavramları ise denizcilik perspektifinde ele alınmış; kitap kapsamında kurgulanan hayali bir geminin seyir, evrak, personel işlemleri çerçevesinde okura sunulmuştur.", "num_reviews": 0},
{"writers": ["İlyas Özer"], "publisher": "Hiperlink Yayınları", "price": 288.0, "url": "https://www.kitapsepeti.com/muhendislik-teknoloji-temel-bilimler-ve-uygulamali-bilimler-fakulteleri-icin-python-ve-matlab-ile-bilisi-matematigi", "title": "Mühendislik Teknoloji Temel Bilimler ve Uygulamalı Bilimler Fakülteleri İçin Python ve Matlab ile Bilişi Matematiği", "category": " Bilim - Mühendislik", "page": 368, "description": "Bilgi ve iletişim teknolojilerindeki gelişmenin yaygın etkisi bilişim sektörünü ve eğitimde bilişim üzerine çalışan alanları doğrudan etkilemiştir. Bu anlamda Bilgi Güvenliği, Algoritmalar, Graf Teori, Matris Cebiri, Nümerik Analiz ve benzeri alanlarda Bilişim Matematiği adıyla yeni bir yaklaşım ortaya çıkmıştır. Özellikle, Yönetim Bilişim Sistemleri, Bilgisayar Mühendisliği, Yazılım Mühendisliği, Bilgisayar Bilimleri gibi bilim ve anabilim dallarında müfredatın Python ve MATLAB gibi programlama dilleri kullanılarak bilişim matematiği kavramının ele alınması gerekmektedir. Bu nedenle, kitabımızı *Python ve MATLAB ile Bilişim Matematiği* ismiyle yukarıda bahsettiğimiz lisans ve lisansüstü bilim ve anabilim dallarına katkı sağlamak için hazırladık. Ülkemizde *Bilişim Matematiği* ismiyle eserler olmasına karşın Python ile uygulama ve örnekleri yapılmış bir eser olmaması bizim bu eseri yazmamızın temel sebebidir. Hem alanında Python ile birlikte yazılan ilk Bilişim Matematiği bilimsel kitabı olması hem de bu alandaki önemli bir boşluğu doldurması açışından eserimizin öncü olacağı ve bu alandaki diğer çalışma ve kitaplara zemin hazırlayacağı inancındayız.", "num_reviews": 0},
{"writers": ["Kubilay Erkeç"], "publisher": "Kodlab Yayın Dağıtım", "price": 103.95, "url": "https://www.kitapsepeti.com/python-ile-algoritma-ve-programlama", "title": "Python İle Algoritma Ve Programlama", "category": " Akademik", "page": 216, "description": "Yazılım öğrenmek isteyen herkes için hazırlanmış olan bu kitapta, öncelikle algoritma hazırlama mantığına odaklanılmıştır. Analitik düşünce ve problem çözme yetenekleri sayesinde hayatta karşımıza çıkan sorunların üstesinden gelirken bu teknikleri kullanmaya başlayacağız. ", "num_reviews": 0},
{"writers": ["Ömer Deperlioğlu"], "publisher": "Seçkin Yayıncılık", "price": 181.83, "url": "https://www.kitapsepeti.com/python-ile-yapay-zekaya-giris", "title": "Python İle Yapay Zekaya Giriş", "category": " Bilgisayar", "page": 430, "description": "Kitap, uzun yıllar üniversitelerde \"Yapay Zeka\", \"Bulanık Mantık \", \"Yapay Sinir Ağları\", \"Zeki Optimizasyon\" derslerini anlatan yazarların notlarından, ders anlatımı esnasında öğrencilerinden gelen sorulardan ve mesleki tecrübelerinden oluşmaktadır.", "num_reviews": 0},
{"writers": ["Kolektif"], "publisher": "Kodlab Yayın Dağıtım", "price": 449.68, "url": "https://www.kitapsepeti.com/python-ogreniyorum-egitim-seti", "title": "Python Öğreniyorum Eğitim Seti", "category": " Akademik", "page": 1236, "description": "PYTHON ÖĞRENİYORUM SETİ", "num_reviews": 0},
{"writers": ["Süleyman Gökhan Günay"], "publisher": "Paradigma Akademi Yayınları", "price": 96.25, "url": "https://www.kitapsepeti.com/python-ile-finans-matematigi", "title": "Python ile Finans Matematiği", "category": " Bilim - Mühendislik", "page": 164, "description": "Python ile Finans Matematiği isimli kitapta son yıllarda finans dünyasında çok kullanılan Python programlama dili kullanılarak basit finans matematiği problemleri çözülmektedir. Bu kitapta amaç kullanıcıya Python yazılım dilinin finans problemlerinin içinde nasıl kullanıldığını göstermek olduğu için burada yer alan bilgiler giriş seviyesindedir. Bu kitapta paranın zaman değeri, tahvil değerlemesi ve hisse senedi değerlemesi konuları ile ilgili basit finansal problemler çözülmüştür. Dünyada en çok kullanılan yapay zekâ dili olan Python yazılımı finans alanındaki problemleri çok hızlı ve etkin bir şekilde çözebilmektedir. Python ile Finans Matematiği isimli kitap serinin ikinci kitabı olup daha sonra yayınlanması planlanan kitaplarda daha ileri seviyede finans problemleri çözülecektir. Kitapta verilen kodlar Visual Studio Code veya PyCharm veya Spyder gibi editörlerde çalıştırılabilir. Bu kitap hem öğrencilerin hem de yöneticilerin finans problemlerini çözmek konusunda kullanabilecekleri başlangıç seviyesinde yardımcı bir eserdir.", "num_reviews": 0},
{"writers": ["Kadir Çamoğlu"], "publisher": "Kodlab Yayın Dağıtım", "price": 154.0, "url": "https://www.kitapsepeti.com/python-tabanli-algoritma", "title": "Python Tabanlı Algoritma", "category": " Akademik", "page": 368, "description": "Python Tabanlı Algoritma kitabının öncelikli amacı programlamaya giriş yapacaklar için doğru bir başlangıç", "num_reviews": 0},
{"writers": ["Erdal Delebe"], "publisher": "Unikod", "price": 112.0, "url": "https://www.kitapsepeti.com/python-programlama-temelleri", "title": "Python Programlama Temelleri", "category": " Bilgisayar", "page": 408, "description": "Uzun cümlelere hiç gerek yok. Bilişim Teknolojileri Eğitimcileri Derneği serisinin 3. kitabı olan “Python ve microPYTHON Programlama”, bilişim teknolojileri eğitiminin kaynak ihtiyacını karşılamak için alanın iki önemli ismi tarafından hazırlandı. Kitap, engin alan bilgisinin ötesinde, içerik sunumu, örneklerin seçimi, bölümlerin yapılandırması gibi her sayfasında fark edeceğiniz öğretmenlik deneyimi ile kazanılmış bir uzmanlığın ürünüdür. Öğrenciler, öğretmenler, programlamaya ilgi duyanlar ve çağın diline hakim olmak isteyenler için faydalı olması dilekleriyle…", "num_reviews": 0},
{"writers": ["Onur Sevli"], "publisher": "Kodlab Yayın Dağıtım", "price": 115.5, "url": "https://www.kitapsepeti.com/python-3", "title": "Python 3", "category": " Bilgisayar", "page": 384, "description": "Python, az kod ile çok iş yapmayı sağlayan, nesne yönelimli, yorumsal, modüler ve yüksek seviyeli bir dildir. Basit bir sözdizimine sahip olan Python ile kolay ve keyifli bir şekilde masaüstü uygulamaları, web uygulamaları, veri analizi ve görselleştirme uygulamaları gibi pek çok alanda yazılımlar geliştirilebilir. Programlamaya yeni başlayanlar için son derece uygun bir dil olmanın yanında profesyonel geliştiriciler için de pratik çözümler sunmaktadır.", "num_reviews": 0},
{"writers": ["Efe Koca"], "publisher": "İkinci Adam Yayınları", "price": 93.0, "url": "https://www.kitapsepeti.com/pyhton-ile-programlama", "title": "Python İle Programlama", "category": " Bilgisayar", "page": 186, "description": "Gelişen teknolojiyle beraber ortaya çıkan programlama dilleri sayesinde yazılımcılar, bir algoritmayı ifade etmek amacıyla bilgisayarlara ne yapmak istediğini anlatır. Günümüzdeki programlama dillerinin çoğu kullanıcıların kolaylıkla kullanacağı şekilde tasarlanmıştır. Bu tür dillere üst düzey diller denir. Üst düzey dillere örnek olarak PHP, C++, Java, Fortran, Perl, Pascal ve kitabımızda da anlatılan Python gibi diller verilebilir.", "num_reviews": 0},
{"writers": ["Nuray Baş"], "publisher": "Nobel Bilimsel Eserler", "price": 53.9, "url": "https://www.kitapsepeti.com/python-tabanli-qgis-whitebox-eklentisi-araciyla-lidar-verilerinden-bina-cikarimi", "title": "Python Tabanlı QGIS-Whitebox Eklentisi Aracıyla Lidar Verilerinden Bina Çıkarımı", "category": " Bilgisayar", "page": 114, "description": "Uzaktan algılama kavramı ilk kez 20. yüzyılın başlarında ortaya atılmıştır. Daha sonra bu teknolojideki gelişmelerle birlikte yeryüzündeki nesnelerin iki ve üç boyutlu modelleri ile objeye ilişkin bilgiler elde edilmeye başlanmıştır. LiDAR (Light Detection and Ranging) tekniği ise ışık ile algılama prensibine dayanan, Türkiye`de yeni olmasına karşın uzaktan algılama biliminde esasen 1960`lı yıllardan itibaren kullanılmaya başlanan eski bir uygulama sayılabilir. Işık hızında çalışması sebebiyle gönderdiği ışık darbeleri ile yeryüzünü hızlı bir şekilde tarayarak 3 boyutlu bilgi sunar. Böylece yeryüzü ve üzerindeki nesneler hakkında bilgi sahibi olabiliriz. Fakat günümüzde, LiDAR tekniği ve uygulamaları ile ilgili daha çok yabancı kaynaklara rastlamaktayız. Bu kitap ile Türkiyedeki araştırmacılar ve öğrencilere LiDAR tekniğinin tanımı, tarihçesi, çalışma prensibi ve uygulamaları hakkında ayrıntılı bilgiler vermek amaçlanmıştır. Okuyucular, kitabın uygulama bölümündeki anlatılanları kavradıktan sonra sadece bina çıkarımı değil LiDAR ile ilgili diğer sınıflandırma uygulamalarını da kolaylıkla yapabileceklerdir. Ayrıca bu kitap, açık erişimli Python Tabanlı QGIS-Whitebox eklentisi aracıyla LiDAR verilerinden bina çıkarımını örnek bir çalışmayla anlatmaktadır. Diğer yandan araştırmacılar ve öğrenciler çoğunlukla pahalı ve ücretli yazılımlara erişim konusunda problem yaşamaktadırlar. Bu problemin üstesinden gelmek için bu kitapta, açık kaynak kodlu ve Python tabanlı uygulamanın kullanım detayları ve örnekleri konusunda detaylı bilgiler bulacaklardır.", "num_reviews": 0},
{"writers": ["Ahmet Aksoy"], "publisher": "Abaküs Kitap", "price": 77.05, "url": "https://www.kitapsepeti.com/cocuklar-icin-raspberry-pi-ve-python-ile-programlama", "title": "Çocuklar İçin Raspberry Pi ve Python ile Programlama", "category": " Bilgisayar", "page": 204, "description": "Çocuklarımız: Geleceğimiz. ", "num_reviews": 0},
{"writers": ["İhsan Özer"], "publisher": "Ekin Basım Yayın", "price": 52.2, "url": "https://www.kitapsepeti.com/c-41236", "title": "C# Java ve Python ile Programlamaya Dalış", "category": " Bilgisayar", "page": 120, "description": "Bu kitabın size üç basit sorusu var? ", "num_reviews": 0},
{"writers": ["Emre S. Özmen"], "publisher": "Nobel Akademik Yayıncılık", "price": 88.55, "url": "https://www.kitapsepeti.com/text-mining-with-python-for-introduction-to-project-management-maturity", "title": "Text Mining with Python for Introduction to Project Management Maturity", "category": " Bilgisayar", "page": 234, "description": "Text mining has a long and rich history with variations of natural language processing methods for many different fields, from pharmaceutical to news sentiments. Likewise, project management has been a mature application domain since the 1960s and with many principles, assumptions, constraints, guidance, knowledge areas, methodologies and processes used for many years. Case studies are one of the fruits of project management, with an output that can expose the level of project management that it yields. This work is an attempt to scrutinize the output with the help of our knowledge and probe the practicality of theories.", "num_reviews": 0},
{"writers": ["Kolektif"], "publisher": "Gece Kitaplığı", "price": 117.42, "url": "https://www.kitapsepeti.com/ornek-uygulamalar-ile-python-programlama-makine-ogrenmesi", "title": "Örnek Uygulamalar İle Python Programlama Makine Öğrenmesi", "category": " Bilim - Mühendislik", "page": 183, "description": "1980’li yıllarının sonunda tasarlanan ve 1991 yılında Hollandalı Guido van Rossum tarafından geliştirilen yüksek seviyeli ve modüler bir program-lama dili olan Python; web sayfası oluşturmadan, API gelişimine kadar pek çok farklı işlevi yerine getirmek için uygun bir yapısı vardır. Fonksiyonel bir yapısı olan Python programlama dili günümüzde özellikle makine öğrenimi, veri analizi ve yapay zekâ çalışmaları için sıklıkla kullanılmaktadır. Konuşma diline yakın bir yapısı olan Python için oluşturulmuş, hazır kütüphaneleri ile küçük projelerden büyük projelere kadar pek çok farklı alanda projeler geliştirilebilir. Basitlik ve okunabilirlik gibi temel özeliklere dayanan Python programlama dilinin Github istatistiklerine baktığı-mızda, 2020 yılında %20,7’lik bir orana sahip olan JavaScript dilinden sonra %17.57’lik oranında en çok uygulama geliştirilen programlama dilidir.", "num_reviews": 0},
{"writers": ["Nuran Bayram Arlı"], "publisher": "Nobel Akademik Yayıncılık", "price": 107.8, "url": "https://www.kitapsepeti.com/denetimli-makine-ogrenmesi-algoritmalari-r-ve-python-uygulamalari", "title": "Denetimli Makine Öğrenmesi Algoritmaları - R ve Python Uygulamaları", "category": " Akademik", "page": 310, "description": "Günümüzde yapay zekânın bir alt kümesi olarak kabul edilen makine öğrenmesi, büyük veri alanının önemli bir bileşenidir. Aynı zamanda makine öğrenmesi, geniş kapsamlı uygulamalarla bilgisayar biliminin en hızlı büyüyen alanları arasında yer almaktadır. Makine öğrenmesi, bilgisayar yazılımlarıyla verilerdeki kalıpları belirlemek için çeşitli algoritmalar kullanarak gelecekteki olayların sınıflanması ve tahmin edilmesinde son yıllarda yoğun bir şekilde hemen hemen tüm bilim dallarında kullanılmaktadır.", "num_reviews": 0},
{"writers": ["Kolektif"], "publisher": "Kodlab Yayın Dağıtım", "price": 295.68, "url": "https://www.kitapsepeti.com/python-egitim-seti", "title": "Python Eğitim Seti", "category": " Bilim - Mühendislik", "page": 582, "description": "• Python Öğreniyorum", "num_reviews": 0},
{"writers": ["Timur Karaçay"], "publisher": "Seçkin Yayıncılık", "price": 180.4, "url": "https://www.kitapsepeti.com/yeni-baslayanlar-icin-python-3-temel-kavramlar", "title": "Yeni Başlayanlar İçin Python 3 Temel Kavramlar", "category": " Eğitim", "page": 458, "description": null, "num_reviews": 0},
{"writers": ["Ahmet Aksoy"], "publisher": "Abaküs Kitap", "price": 67.0, "url": "https://www.kitapsepeti.com/opencv-ve-python-ile-eglenceli-projeler-ve-oyunlar-egitim-videolu", "title": "OpenCV ve Python ile Eğlenceli Projeler ve Oyunlar Eğitim Videolu", "category": " Bilgisayar", "page": 160, "description": "OpenCV-3.4.13 ve OpenCV-4.5.1 Uyumlu", "num_reviews": 0},
{"writers": ["Sinan Uğuz"], "publisher": "Nobel Akademik Yayıncılık", "price": 154.0, "url": "https://www.kitapsepeti.com/makine-ogrenmesi-teorik-yonleri-ve-python-uygulamalari", "title": "Makine Öğrenmesi Teorik Yönleri ve Python Uygulamaları", "category": " Bilim - Mühendislik", "page": 312, "description": "Yapay zekânın bir alt alanı olarak ifade edilen makine öğrenmesi mühendislik, finans ve biyoinformatik`in başı çektiği birçok alanda yaygın olarak kullanılmaktadır. Makine öğrenmesi uygulamaları geliştirmek için temelinde kalkülüs, doğrusal cebir ve istatistik barındıran bazı algoritmaların teorik olarak kavranması önemlidir. Bu algoritmaların teorik yönleri öğrenildikten sonra Python gibi kolay ve zengin kütüphane yapısına sahip bir programlama dili ile kodlanarak uygulama geliştirilebilir. Kitaptaki makine öğrenmesi algoritmalarının teorik yönleri titizlikle irdelenmiş, gerek duyulan doğrusal cebir ve istatistik konuları da özet olarak incelenmiştir. Özgün veri setleri içeren problemler kullanılarak her algoritma için Python uygulamaları geliştirilmiştir. Makine öğrenmesinin bir alt alanı olan Derin Öğrenme ile uygulama geliştirmek isteyen kişilerin de özellikle bu kitaptaki temel bilgileri öğrenmesi önemli bir alt yapı oluşturmalarını sağlayacaktır. Bu kitabı okuduktan sonra derin öğrenme mimarilerinin anlaşılması daha kolay olacaktır.", "num_reviews": 0},
{"writers": ["İsmail Sarı"], "publisher": "Ekin Basım Yayın", "price": 108.75, "url": "https://www.kitapsepeti.com/c-78358", "title": "C# ve Python ile Programlama", "category": " Bilim - Mühendislik", "page": 254, "description": "Bu kitap özellikle bilgisayar programlamaya yeni başlayanlar için uygulama örnekleri geliştirebilmesi bakımından faydalı olacaktır. Algoritma oluşturma ve oluşturulan algoritma ile (pascal destekli), python ve C# dillerinde yazılması programlama tekniklerinin gelişmesi bakımından faydalı olacaktır.", "num_reviews": 0},
{"writers": ["Murat Işık"], "publisher": "Seçkin Yayıncılık", "price": 194.01, "url": "https://www.kitapsepeti.com/opencv-ve-python-ile-goruntu-isleme", "title": "OpenCV ve Python ile Görüntü İşleme", "category": " Akademik", "page": 464, "description": "Hızlı gelişen teknolojiyle birlikte artık yaşamlarımızın bir parçası haline gelen görüntü işleme neredeyse tüm alanlarda kullanılmaktadır. Bu alanlara; röntgen, MR, tomografi gibi tıbbi görüntüleme sistemleri, yüz tanıma, plaka tanıma, nesne takibi gibi güvenlik sistemleri, haritalama, yol çizimleri gibi uydu sistemleri, sonar görüntüleme, termal görüntüleme, gece görüşü gibi askeri sistemler ve oyun geliştirmeleri örnek olarak verilebilir.", "num_reviews": 0},
{"writers": ["Bülent Çobanoğlu"], "publisher": "Pusula Yayıncılık", "price": 66.6, "url": "https://www.kitapsepeti.com/cocuklar-icin-python", "title": "Çocuklar İçin Python", "category": " Çocuk Kitapları", "page": 208, "description": "Python Öğrenmek Bu Kitapla Çok Kolay!", "num_reviews": 0},
{"writers": ["Adrienne Tacke"], "publisher": "Sola Kidz", "price": 190.08, "url": "https://www.kitapsepeti.com/cocuklar-icin-kodlama-python", "title": "Çocuklar için Kodlama: Python", "category": " Bilgisayar", "page": 224, "description": "HARİKA UYGULAMALARLA PYTHON KODLAMAYI ÖĞRENİN!", "num_reviews": 0},
{"writers": ["Bülent Çobanoğlu"], "publisher": "Pusula Yayıncılık", "price": 81.4, "url": "https://www.kitapsepeti.com/herkes-icin-python", "title": "Herkes İçin Python", "category": " Bilgisayar", "page": 384, "description": null, "num_reviews": 0},
{"writers": ["Kolektif"], "publisher": "Kodlab Yayın Dağıtım", "price": 680.68, "url": "https://www.kitapsepeti.com/super-python-seti-2-5-kitap-takim", "title": "Süper Python Seti 2 5 Kitap Takım", "category": " Bilgisayar", "page": 2296, "description": "Kitap Hakkında;", "num_reviews": 0},
{"writers": ["Kolektif"], "publisher": "NOBEL AKADEMİK YAYINCILIK", "num_reviews": 0, "stars": 0, "price": 54.6, "url": "https://www.kitapyurdu.com/kitap/text-mining-applications-using-realworld-data-in-python/577218.html&filter_name=python", "title": "Text Mining Applications Using Real-World Data in Python", "category": "Diğer Dildeki Yayınlar", "page": 124, "bought": 20, "description": "Over the last two decades, the amount of existing data sources in the world have dramatically increased due largely to digitalization. In parallel, data analysis has become a crucial topic for researchers in many areas. One of the essential perspectives in data analysis is text mining. In various forms, textual data is the most generated data element compared to multimedia data. Since the available data sizes are exponentially increasing, we need intelligent computational methodologies to handle massive datasets. Data mining approaches, specifically text mining techniques, come into prominence. The application of both text mining and machine learning techniques together on data analysis provides decent solutions. For that purpose, this book is prepared with four major chapters discussing various aspects of data analysis with text mining methods, such as clustering, classification, sentiment analysis, and prediction tasks implemented in the Python programming language."},
{"writers": ["Mustafa Murat Coşkun"], "publisher": "DİKEYEKSEN YAYINCILIK", "num_reviews": 18, "stars": 4, "price": 103.13, "url": "https://www.kitapyurdu.com/kitap/python-ile-cocuklar-icin-programlama/433523.html&filter_name=python", "title": "Python ile Çocuklar için Programlama", "category": "Bilgisayar", "page": 200, "bought": 367, "description": "Bu kitap, ülkemizdeki çocukların programlama öğrenme merakını gidermek ve onlara programlamanın temellerini Python diliyle anlatmak için oluşturulmuş bir giriş kitabı niteliğindedir."},
{"writers": ["Doç. Dr. Engin Sorhun"], "publisher": "ABAKÜS KİTAP", "num_reviews": 6, "stars": 4, "price": 129.5, "url": "https://www.kitapyurdu.com/kitap/python-ile-makine-ogrenmesi/585343.html&filter_name=python", "title": "Python ile Makine Öğrenmesi", "category": "Bilgisayar", "page": 464, "bought": 170, "description": "Bu çalışmada 31 makine öğrenmesi algoritması, 22 makine öğrenmesi metodu, 33 Python kütüphanesi, 14 özgün veri seti ile sosyal bilimlerin özellikle ekonomi, finans, işletme alanlarına dair örnek uygulamalar yer almaktadır. "},
{"writers": ["Volkan Taşçı"], "publisher": "DİKEYEKSEN YAYINCILIK", "num_reviews": 22, "stars": 4, "price": 206.25, "url": "https://www.kitapyurdu.com/kitap/python-egitim-kitabi/513260.html&filter_name=python", "title": "Python Eğitim Kitabı", "category": "Bilgisayar", "page": 560, "bought": 562, "description": "Python öğrenmek için ihtiyacınız olan tek kitap! Python Eğitim Kitabı, öğrenciler, mühendisler, çalışanlar ve Python öğrenmek isteyenler düşünülerek herkese hitap edecek şekilde görsellerle zenginleştirilmiş, bolca kod örnekleri ve projelerle okura pratiklik kazandırılması amaçlanarak kaleme alınmıştır. Projeler özellikle okurun düşünme refleksine yön vermek için bazen zorlu yollarla tasarlanmış bazen de pratiklik kazandırması amacıyla kolay yollar tercih edilmiştir. Yalnızca Python değil diğer tüm programlama dilleri için geçerli olan verilerin saklanması konusu birden çok metot ile gösterilmiş, farklı dosya formatları ile çalışması anlatılmıştır. Belki de en önemli konu olan Nesne Tabanlı Programlama derinlemesine işlenmiş örneklerle pekiştirilmiştir."},
{"writers": ["Gizem Kodak"], "publisher": "NOBEL BİLİMSEL", "num_reviews": 0, "stars": 0, "price": 72.25, "url": "https://www.kitapyurdu.com/kitap/denizcilik-perspektifinden-python-program-dilinin-temelleri/647406.html&filter_name=python", "title": "Denizcilik Perspektifinden Python Program Dilinin Temelleri", "category": "Akademik", "page": 126, "bought": 15, "description": "Günümüzde, gemilerin AIS (Otomatik Tanımlama Sistemi) ile donatılması, denizcilik disiplini içerisinde birçok bilimsel alana büyük veri ile çalışma imkânı sunmaktadır. Özellikle yüksek çözünürlüklü sonuçlar veren model çalışmalarında veri analizi için kullanışlı program dillerine olan ihtiyaç her geçen gün artmaktadır. Gemilerin AIS sinyalleri üzerinden anlık olarak izlenmesiyle oluşan büyük veri, çevresel boyutta gemi emisyon hesaplamaları ve hava kalitesi modellerinden seyir boyutunda risk analizi ve kaza modellemesine kadar geniş bir yelpazede çalışma fırsatı sağlamaktadır. Python program dili bu veriyi işleme konusunda kritik bir araçtır. Python kullanımı için temel bilgileri içeren bu çalışmada Python operatörleri, Python'da kullanılan veri tipi/yapıları incelenmiş, gömülü fonksiyonlar ve yaygın olarak kullanılan pratik metotlar örneklerle açıklanmıştır. İç içe veriler, koşullu ifadeler ve döngü kavramları ise denizcilik perspektifinde ele alınmış; kitap kapsamında kurgulanan hayali bir geminin seyir, evrak, personel işlemleri çerçevesinde okura sunulmuştur."},
{"writers": ["Nuray Baş"], "publisher": "NOBEL BİLİMSEL", "num_reviews": 0, "stars": 0, "price": 59.5, "url": "https://www.kitapyurdu.com/kitap/python-tabanli-qgiswhitebox-eklentisi-araciyla-lidar-verilerinden-bina-cikarimi/651902.html&filter_name=python", "title": "Python Tabanlı QGIS-WhItebox Eklentisi Aracıyla LiDAR Verilerinden Bina Çıkarımı", "category": "Bilgisayar", "page": 114, "bought": null, "description": "Uzaktan algılama kavramı ilk kez 20. yüzyılın başlarında ortaya atılmıştır. Daha sonra bu teknolojideki gelişmelerle birlikte yeryüzündeki nesnelerin iki ve üç boyutlu modelleri ile objeye ilişkin bilgiler elde edilmeye başlanmıştır. LiDAR (Light Detection and Ranging) tekniği ise ışık ile algılama prensibine dayanan, Türkiye'de yeni olmasına karşın uzaktan algılama biliminde esasen 1960'lı yıllardan itibaren kullanılmaya başlanan eski bir uygulama sayılabilir. Işık hızında çalışması sebebiyle gönderdiği ışık darbeleri ile yeryüzünü hızlı bir şekilde tarayarak 3 boyutlu bilgi sunar. Böylece yeryüzü ve üzerindeki nesneler hakkında bilgi sahibi olabiliriz."},
{"writers": ["Bülent Çobanoğlu"], "publisher": "Kodlab Yayın Dağıtım", "price": 138.6, "url": "https://www.kitapsepeti.com/veri-bilimi-icin-python", "title": "Veri Bilimi İçin Python", "category": " Bilgisayar", "page": 512, "description": "Hislerine göre değil de veriye dayalı kararlar verebilmek için veri bilimine ihtiyaç vardır. Veri bilimi disiplinler arası bir çalışma alanıdır. Ve bir veri bilimcisinin, kullandığı programlama dili ve araçlarına (ki şu an için en yaygın dil Python) hâkim olması gerekir. ", "num_reviews": 0},
{"writers": ["Kolektif"], "publisher": "Kodlab Yayın Dağıtım", "price": 923.23, "url": "https://www.kitapsepeti.com/super-python-seti-3-7-kitap-takim", "title": "Süper Python Seti 3 7 Kitap Takım", "category": " Bilgisayar", "page": 3120, "description": "Süper Python Seti 3", "num_reviews": 0},
{"writers": ["Can Aydın"], "publisher": "Nobel Akademik Yayıncılık", "price": 69.3, "url": "https://www.kitapsepeti.com/isletmeler-icin-python-uygulamalari", "title": "İşletmeler İçin Python Uygulamaları", "category": " Bilgisayar", "page": 156, "description": "Günümüzde bilgi ve iletişim teknolojilerinin hızlı yükselişi ile hemen her alanda bilgi sistemlerinin kullanıldığını görmekteyiz. İşletmeler, iş süreçlerinde bilgi sistemlerini sadece kullanmak yerine bu sistemlerin üretilmesi konusunda da adımlar atmaktadır. Bu adımların atılmasında programlama becerisi hayati bir öneme sahiptir. Veri analizi ve yapay zekâ çalışmaları son yıllarda teorik ortamdan çıkarak birçok işletme probleminin çözümünde kullanılmaktayken sosyal bilimler alanında özellikle işletme, iktisat, maliye ve yönetim bilişim sistemleri bölümlerinde okuyan öğrencilerin gelişen şartlara ayak uydurmak hem de mevcut problemlerini çözmek için programlama eğitim almaları zorunlu hâle gelmiştir.", "num_reviews": 0},
{"writers": ["Bekir Aksoy"], "publisher": "Nobel Akademik Yayıncılık", "price": 84.7, "url": "https://www.kitapsepeti.com/python-ile-imgeden-veriye-goruntu-isleme-ve-uygulamalari", "title": "Python ile İmgeden Veriye Görüntü İşleme ve Uygulamaları", "category": " Akademik", "page": 188, "description": "Günümüzde teknolojinin hızla gelişmesi ile birlikte görüntü işleme tekniklerinin önemi de artmıştır. Hazırlanan kitapta, görüntü işleme teknikleri bilimsel olarak detaylı bir şekilde anlatılmıştır. Bilimsel olarak ifade edilen görüntü işleme tekniklerinin daha iyi anlaşılabilmesi için Python programlama dilinde hazırlanan örnek uygulamalar geliştirilmiştir. Kitapta gerçekleştirilen uygulamalarda Python programlama dilinin kullanılmasının en önemli sebeplerinden birisi, açık kaynak kod özelliğine sahip olmasıdır. Bu kitabı inceleyen okuyucular, görüntü işleme teknikleri ve bu tekniklere ait uygulamalar ile görüntü işleme yöntemlerini daha kolay bir şekilde anlayabileceklerdir.", "num_reviews": 0},
{"writers": ["Kolektif"], "publisher": "Kodlab Yayın Dağıtım", "price": 488.18, "url": "https://www.kitapsepeti.com/super-python-seti", "title": "Süper Python Seti", "category": " Bilgisayar", "page": 1588, "description": "PYTHON Konusunda başlangıçtan uzmanlığa giden Süper set", "num_reviews": 0},
{"writers": ["Yahya Kesenek"], "publisher": "Level Kitap", "price": 170.97, "url": "https://www.kitapsepeti.com/python-ve-kivy-ile-cross-platform-uygulama-gelistirme", "title": "Python ve Kivy İle Cross Platform Uygulama Geliştirme", "category": " Bilgisayar", "page": 274, "description": "Kivy, Python programlama dili ile geliştirilmiş açık kaynaklı (open source) bir framework’tür. Windows, Linux, Android, iOS ve Raspberry Pi gibi tüm platformlarda çalışan multi-touch (çoklu dokunuş) destekli bir yazılım dili olmasıyla beraber, Kivy’nin Python diliyle yazılmış olması da hızlı yazılım (rapid development) geliştirme olanağı veriyor. Maceracı ruhlu yazılımcıların ufkunu açacak bu kitabımız, programlamaya yeni başlayanlara da Python dilinin güçlü yapısını tanıtacak ve her platformda çalışacak güçlü yazılımların nasıl geliştirebileceğine rehberlik edecektir.", "num_reviews": 0},
{"writers": ["Ercan Bozkurt"], "publisher": "Abaküs Kitap", "price": 56.95, "url": "https://www.kitapsepeti.com/sorularla-python-ogreniyorum", "title": "Sorularla Python Öğreniyorum", "category": " Bilgisayar", "page": 256, "description": "Açıklamalı Cevapları Ve Videolarla 400’den Fazla Soru", "num_reviews": 0},
{"writers": ["Yılmaz Alaca", "Emine Yalçın"], "publisher": "DİKEYEKSEN YAYINCILIK", "num_reviews": 0, "stars": 0, "price": 275.0, "url": "https://www.kitapyurdu.com/kitap/python-ile-arduino-icin-arayuz-gelistirme-seti-2-kitap/654062.html&filter_name=python", "title": "Python ile Arduino için Arayüz Geliştirme Seti (2 Kitap)", "category": null, "page": 324, "bought": null, "description": "Alanında uzman yazarlar tarafından kaleme alınan bu iki kitabı sizin için set haline getirdik.  "},
{"writers": ["Ahmet Sel"], "publisher": "Akademisyen Kitabevi", "price": 164.0, "url": "https://www.kitapsepeti.com/python-uygulamali-istatiksel-veri-bilimi-ve-analizi", "title": "Python Uygulamalı İstatiksel Veri Bilimi ve Analizi", "category": " Bilgisayar", "page": 412, "description": "Python Uygulamalı İstatiksel Veri Bilimi ve Analizi", "num_reviews": 0},
{"writers": ["Ali Çetinkaya"], "publisher": "İSTANBUL GELİŞİM ÜNİVERSİTESİ YAYINLARI", "num_reviews": 0, "stars": 0, "price": 286.65, "url": "https://www.kitapyurdu.com/kitap/bulanik-mantik-ve-python-uygulamalari/644153.html&filter_name=python", "title": "Bulanık Mantık ve Python Uygulamaları", "category": "Bilgisayar", "page": 144, "bought": 4, "description": "Gelişen ve değişen teknoloji ile cihazların kontrolü üzerindeki ihtiyaç günden güne artmaktadır. Mevcut sistemlerin kontrolünde, yazılım dilleri üzerinde geliştirilen algoritmaların önemi büyüktür. Bulanık mantık (BM) sistemlerin kontrolü hayatımızın ayrılmaz bir parçası haline gelmiştir. Bulanık mantık hakkında yabancı dillerde çok sayıda çalışma mevcuttur. Bunlar arge araştırmaları, kitaplar, ders notları, makaleler ve bildiri çalışmalarıdır. Bu yayınlar arasında günümüz programlama dillerinden olan Python programlama dili ile hazırlanmış kapsamlı bir Türkçe Bulanık mantık kaynağı yer almamaktadır. Bu kitap Python programlama dili üzerinde geliştirilmiş bulanık mantık çalışmaları konusunda Türkçe literatüre katkı sağlayacaktır. "},
{"writers": ["Mustafa Başer"], "publisher": "Dikeyeksen Yayın Dağıtım", "price": 453.6, "url": "https://www.kitapsepeti.com/python-veri-bilimi-ve-yapay-zeka-seti-5-kitap", "title": "Python, Veri Bilimi ve Yapay Zeka Seti 5 Kitap", "category": " Bilgisayar", "page": 1872, "description": null, "num_reviews": 0},
{"writers": ["Eric Matthes"], "publisher": "Buzdağı Yayınevi", "price": 430.65, "url": "https://www.kitapsepeti.com/kapsamli-python-kursu", "title": "Kapsamlı Python Kursu", "category": " Bilgisayar", "page": 608, "description": "Kapsamlı Python Kursu, dünyada Python programlama dili için yazılmış en çok satan ve beğenilen kitaptır. Python ile programlamaya bu hızlı giriş sayesinde programlar yazacak, problemleri çözecek ve işlerinizi çabucak halledeceksiniz.", "num_reviews": 0},
{"writers": ["Al Sweigart"], "publisher": "Buzdağı Yayınevi", "price": 430.65, "url": "https://www.kitapsepeti.com/python-ile-sikici-isleri-aninda-bitir", "title": "Python ile Sıkıcı İşleri Anında Bitir", "category": " Bilgisayar", "page": 672, "description": "Daha önce her iş günü, her hafta veya her ay, onlarca dosyayla rutin işler yaparken, farklı internet sitelerinden topladığınız veya e-postalarla düzenli olarak size iletilen sayısız veriyle çalışırken veya sürekli güncel tutulması gereken o çok önemli Excel dosyalarına yeni verileri girerken saatler harcadıysanız, bu işlerin ne kadar sıkıcı olduğunu biliyorsunuz demektir. Peki ya bu işleri sizin yerinize bilgisayarınız yapsaydı? ", "num_reviews": 0},
{"writers": ["Algın Okursoy"], "publisher": "GAZİ KİTABEVİ", "num_reviews": 0, "stars": 0, "price": 51.01, "url": "https://www.kitapyurdu.com/kitap/cok-kriterli-karar-verme-python-programlama-dili-ile-uygulama/652132.html&filter_name=python", "title": "Çok Kriterli Karar Verme: Python Programlama Dili ile Uygulama", "category": "Akademik", "page": 95, "bought": 1, "description": " "},
{"writers": ["Engin Bozaba"], "publisher": "Dikeyeksen Yayın Dağıtım", "price": 144.0, "url": "https://www.kitapsepeti.com/python-ile-uctan-uca-veri-bilimi", "title": "Python ile Uçtan Uca Veri Bilimi", "category": " Bilim - Mühendislik", "page": 280, "description": "Bu kitap ile Python programlama bilginizi kullanarak Veri Bilimi dünyasına ilk adımınızı atacaksınız. Kitapla birlikte başlangıç seviyesinden basamak basamak çıkarak uçtan uca bir veri bilimi proje geliştirebileceksiniz. Ve aynı zamanda bu yolda kullanacağımız araçları, kütüphaneleri ve yöntemleri beraber deneyimleyeceğiz. Ama bu kitap sadece sizin için bir başlangıçtır. Çünkü asıl kazanımlarınızı kitap sonrası kendi başınıza veya ekibinizle geliştirdiğiniz projelerde elde edeceksiniz.", "num_reviews": 0},
{"writers": ["Mustafa Murat Coşkun"], "publisher": "Dikeyeksen Yayın Dağıtım", "price": 108.0, "url": "https://www.kitapsepeti.com/python-ile-cocuklar-icin-programlama", "title": "Python ile Çocuklar İçin Programlama", "category": " Bilgisayar", "page": 200, "description": "Bu kitap, ülkemizdeki çocukların programlama öğrenme merakını gidermek ve onlara programlamanın temellerini Python diliyle anlatmak için oluşturulmuş bir giriş kitabı niteliğindedir.", "num_reviews": 0},
{"writers": ["Erdal Delebe", "Serhat Kağan Şahin"], "publisher": "UNIKOD", "num_reviews": 0, "stars": 0, "price": 176.0, "url": "https://www.kitapyurdu.com/kitap/python-ve-raspberry-pi-ile-nesnelerin-interneti-nesnelerin-interneti/650044.html&filter_name=python", "title": "Python ve Raspberry Pi ile Nesnelerin İnterneti ", "category": "Bilgisayar", "page": 432, "bought": 166, "description": "Bu kitap ile Nesnelerin İnterneti üzerine geliştirebileceğiniz onlarca proje bulunmakla birlikte bu alanda kullanabileceğiniz pek çok platformun kullanımı detaylı bir şekilde anlatılmaktadır. Kitap içeriğinde günümüzde çok sık kullanılan Raspberry Pi kartını temelden kullanma beceresini kazanarak Python programlama dili ile temel seviyeden başlayıp ileri seviye projeler geliştirebileceksiniz."},
{"writers": ["Ahmet Aksoy"], "publisher": "ABAKÜS KİTAP", "num_reviews": 8, "stars": 4, "price": 78.0, "url": "https://www.kitapyurdu.com/kitap/opencv-ve-python-ile-eglenceli-projeler-ve-oyunlar-egitim-videolu/513028.html&filter_name=python", "title": "OpenCV ve Python ile Eğlenceli Projeler ve Oyunlar (Eğitim Videolu)", "category": "Bilim & Mühendislik", "page": 160, "bought": 196, "description": "OpenCV ve Python ile Eğlenceli Projeler ve Oyunlar"},
{"writers": ["Mustafa Murat Coşkun", "Volkan Taşçı"], "publisher": "DİKEYEKSEN YAYINCILIK", "num_reviews": 0, "stars": 0, "price": 275.0, "url": "https://www.kitapyurdu.com/kitap/2li-python-egitim-seti-2-kitap/646760.html&filter_name=python", "title": "2'li Python Eğitim Seti (2 Kitap)", "category": "Bilgisayar", "page": 760, "bought": 1, "description": "Alanında uzman yazarlar tarafından kaleme alınan bu iki kitabı sizin için set haline getirdik.  "},
{"writers": ["Kolektif"], "publisher": "UNIKOD", "num_reviews": 0, "stars": 0, "price": 266.0, "url": "https://www.kitapyurdu.com/kitap/python-uzmanlik-seti-2-kitap/573505.html&filter_name=python", "title": "Python Uzmanlık Seti (2 Kitap)", "category": "Bilgisayar", "page": 928, "bought": 22, "description": "Unikod ekibi tarafından özel olarak hazırlanan bu set ile Python programlamaya “Merhaba” deyin."},
{"writers": ["Ercan  Bozkurt", "Hakan Yalçın kaya"], "publisher": "ABAKÜS KİTAP", "num_reviews": 0, "stars": 0, "price": 66.3, "url": "https://www.kitapyurdu.com/kitap/sorularla-python-egitim-videolu/512389.html&filter_name=python", "title": "Sorularla Python (Eğitim Videolu)", "category": "Başvuru Kitapları", "page": 256, "bought": 81, "description": " "},
{"writers": ["Yahya Kesenek"], "publisher": "LEVEL KİTAP", "num_reviews": 7, "stars": 4, "price": 160.55, "url": "https://www.kitapyurdu.com/kitap/python-ve-kivy-ile-cross-platform-uygulama-gelistirme/409173.html&filter_name=python", "title": "Python ve Kivy ile Cross Platform Uygulama Geliştirme", "category": "Bilgisayar", "page": 274, "bought": 142, "description": "Kivy, Python programlama dili ile geliştirilmiş açık kaynaklı ("},
{"writers": ["Mustafa Aydemir"], "publisher": "Kodlab Yayın Dağıtım", "price": 103.95, "url": "https://www.kitapsepeti.com/projeler-ile-python", "title": "Projeler ile Python", "category": " Bilgisayar", "page": 264, "description": "Python kodlarının okunma kolaylığı ve modüler sistemi birden çok yazılımcıyla geliştirilen bir ekip çalışmasında büyük kolaylık sağlar.", "num_reviews": 0},
{"writers": ["Prof. Dr Engin Sorhun"], "publisher": "ABAKÜS KİTAP", "num_reviews": 0, "stars": 0, "price": 108.0, "url": "https://www.kitapyurdu.com/kitap/python-ile-ekonometri-wooldridgein-ekonometriye-giris-uygulamalari/594269.html&filter_name=python", "title": "Python ile Ekonometri / Wooldridge’in Ekonometriye Giriş Uygulamaları", "category": "Eğitim", "page": 352, "bought": 94, "description": "İstatistik ve ekonometri paket programları için her sene neden milyonlarca dolar ödüyoruz? Üniversitelerimiz, özel ve kamu sektörü kuruluşları, araştırma merkezleri, bilim insanları, öğrenciler… Şimdi dünyanın açık kaynaklı (ücretsiz) araçlara yelken açtığı bir zamanda bir avuç şirkete yaptığımız bunca ödeme ne kadar gerekli?"},
{"writers": ["Mustafa Başer", "Volkan Taşçı"], "publisher": "DİKEYEKSEN YAYINCILIK", "num_reviews": 0, "stars": 0, "price": 343.75, "url": "https://www.kitapyurdu.com/kitap/herkes-icin-2li-python-egitim-seti-2-kitap/646759.html&filter_name=python", "title": "Herkes için 2'li Python Eğitim Seti (2 Kitap)", "category": "Bilgisayar", "page": 1104, "bought": 1, "description": "Alanında uzman yazarlar tarafından hazırlanan bu kitaplar ile "},
{"writers": ["Bekir Aksoy"], "publisher": "NOBEL AKADEMİK YAYINCILIK", "num_reviews": 0, "stars": 0, "price": 90.26, "url": "https://www.kitapyurdu.com/kitap/python-ile-imgeden-veriye-goruntu-isleme-ve-uygulamalari/539377.html&filter_name=python", "title": "Python ile İmgeden Veriye Görüntü İşleme ve Uygulamaları", "category": "Akademik", "page": 188, "bought": 177, "description": "Günümüzde teknolojinin hızla gelişmesi ile birlikte görüntü işleme tekniklerinin önemi de artmıştır. Hazırlanan kitapta, görüntü işleme teknikleri bilimsel olarak detaylı bir şekilde anlatılmıştır. Bilimsel olarak ifade edilen görüntü işleme tekniklerinin daha iyi anlaşılabilmesi için Python programlama dilinde hazırlanan örnek uygulamalar geliştirilmiştir. Kitapta gerçekleştirilen uygulamalarda Python programlama dilinin kullanılmasının en önemli sebeplerinden birisi, açık kaynak kod özelliğine sahip olmasıdır. Bu kitabı inceleyen okuyucular, görüntü işleme teknikleri ve bu tekniklere ait uygulamalar ile görüntü işleme yöntemlerini daha kolay bir şekilde anlayabileceklerdir."},
{"writers": ["Atıl Samancıoğlu"], "publisher": "UNIKOD", "num_reviews": 12, "stars": 4, "price": 154.0, "url": "https://www.kitapyurdu.com/kitap/python-sifirdan-uzmanliga-programlama/551027.html&filter_name=python", "title": "Python Sıfırdan Uzmanlığa Programlama", "category": "Bilgisayar", "page": 520, "bought": 824, "description": "Kitap, dünyanın 170 ülkesinde 250.000’den fazla öğrenciye yazılım ve siber güvenlik eğitimleri veren Atıl Samancıoğlu tarafından kaleme alındı."},
{"writers": ["Sinan  Uğuz"], "publisher": "NOBEL AKADEMİK YAYINCILIK", "num_reviews": 10, "stars": 5, "price": 164.12, "url": "https://www.kitapyurdu.com/kitap/makine-ogrenmesi-teorik-yonleri-ve-python-uygulamalari-ile-bir-yapay-zeka-ekolu/533396.html&filter_name=python", "title": "Makine Öğrenmesi Teorik Yönleri Ve Python Uygulamaları İle Bir Yapay Zeka Ekolü", "category": "Bilim & Mühendislik", "page": 312, "bought": 424, "description": "Yapay zekânın bir alt alanı olarak ifade edilen makine öğrenmesi mühendislik, finans ve biyoinformatik'in başı çektiği birçok alanda yaygın olarak kullanılmaktadır. Makine öğrenmesi uygulamaları geliştirmek için temelinde kalkülüs, doğrusal cebir ve istatistik barındıran bazı algoritmaların teorik olarak kavranması önemlidir. Bu algoritmaların teorik yönleri öğrenildikten sonra Python gibi kolay ve zengin kütüphane yapısına sahip bir programlama dili ile kodlanarak uygulama geliştirilebilir. Kitaptaki makine öğrenmesi algoritmalarının teorik yönleri titizlikle irdelenmiş, gerek duyulan doğrusal cebir ve istatistik konuları da özet olarak incelenmiştir. Özgün veri setleri içeren problemler kullanılarak her algoritma için Python uygulamaları geliştirilmiştir. Makine öğrenmesinin bir alt alanı olan Derin Öğrenme ile uygulama geliştirmek isteyen kişilerin de özellikle bu kitaptaki temel bilgileri öğrenmesi önemli bir alt yapı oluşturmalarını sağlayacaktır. Bu kitabı okuduktan sonra derin öğrenme mimarilerinin anlaşılması daha kolay olacaktır."},
{"writers": ["Bülent Çobanoğlu"], "publisher": "PUSULA YAYINCILIK VE İLETİŞİM", "num_reviews": 0, "stars": 0, "price": 87.23, "url": "https://www.kitapyurdu.com/kitap/herkes-icin-python/478372.html&filter_name=python", "title": "Herkes İçin Python", "category": "Bilim & Mühendislik", "page": 384, "bought": 229, "description": "Modüler, % 100 nesne yönelimli, açık kaynaklı (ücretsiz), platformdan bağımsız, yorumlayıcı"},
{"writers": ["Mustafa Başer", "Mustafa Murat Coşkun", "Volkan Taşçı"], "publisher": "DİKEYEKSEN YAYINCILIK", "num_reviews": 0, "stars": 0, "price": 343.75, "url": "https://www.kitapyurdu.com/kitap/python-egitim-seti-3-kitap/576609.html&filter_name=python", "title": "Python Eğitim Seti (3 Kitap)", "category": "Bilgisayar", "page": 1304, "bought": 52, "description": "Prof. Dr. Mustafa Başer, Volkan Taşcı ve Mustafa Murat Coşkun eğitmen ve yazarların kaleme aldığı kitaplardan oluşan bu setin amacı "},
{"writers": ["Kolektif"], "publisher": "NOBEL AKADEMİK YAYINCILIK", "num_reviews": 0, "stars": 0, "price": 118.3, "url": "https://www.kitapyurdu.com/kitap/denetimli-makine-ogrenmesi-algoritmalari-r-ve-python-uygulamalari/631720.html&filter_name=python", "title": "Denetimli Makine Öğrenmesi Algoritmaları - R ve Python Uygulamaları", "category": "Bilim & Mühendislik", "page": 310, "bought": 29, "description": "Günümüzde yapay zekânın bir alt kümesi olarak kabul edilen makine öğrenmesi, büyük veri alanının önemli bir bileşenidir. Aynı zamanda makine öğrenmesi, geniş kapsamlı uygulamalarla bilgisayar biliminin en hızlı büyüyen alanları arasında yer almaktadır. Makine öğrenmesi, bilgisayar yazılımlarıyla verilerdeki kalıpları belirlemek için çeşitli algoritmalar kullanarak gelecekteki olayların sınıflanması ve tahmin edilmesinde son yıllarda yoğun bir şekilde hemen hemen tüm bilim dallarında kullanılmaktadır."}
]